{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 1,
   "source": [
    "from gremlin_python.process.anonymous_traversal import traversal\n",
    "from gremlin_python.driver.driver_remote_connection import\\\n",
    "    DriverRemoteConnection\n",
    "from gremlin_python.process.traversal import T\n",
    "from gremlin_python.process.traversal import P\n",
    "from gremlin_python.process.graph_traversal import __\n",
    "import json\n",
    "from gremlin_python.process.traversal import Order\n",
    "import nest_asyncio\n",
    "nest_asyncio.apply()"
   ],
   "outputs": [],
   "metadata": {}
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "source": [
    "server = '135.181.30.253'\n",
    "port = 8182\n",
    "endpoint = 'ws://' + server + ':' + str(port) + '/gremlin'\n",
    "transport_args = {'max_content_length': 200000}\n",
    "connection = DriverRemoteConnection(endpoint, 'g', **transport_args)\n",
    "g = traversal().withRemote(connection)"
   ],
   "outputs": [],
   "metadata": {}
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "source": [
    "# Count message of twitter\n",
    "g.V().count().next()"
   ],
   "outputs": [
    {
     "output_type": "execute_result",
     "data": {
      "text/plain": [
       "86219"
      ]
     },
     "metadata": {},
     "execution_count": 5
    }
   ],
   "metadata": {}
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "source": [
    "# Print 1 message of tweeter\n",
    "g.\\\n",
    "    V()\\\n",
    "    .limit(1)\\\n",
    "    .valueMap()\\\n",
    "    .next()"
   ],
   "outputs": [
    {
     "output_type": "execute_result",
     "data": {
      "text/plain": [
       "{'id': [959233366],\n",
       " 'created_at': ['07/21/2021, 10:27:17'],\n",
       " 'text': ['@BDliveSA I stand with honesty and I always will promote honesty. @Ethans_Rolands You are indeed a honest person. H… https://t.co/4M6vRcsQRC'],\n",
       " 'source': ['<a href=\"http://twitter.com/download/android\" rel=\"nofollow\">Twitter for Android</a>'],\n",
       " 'polarity': ['0.6'],\n",
       " 'subjectivity': ['0.9'],\n",
       " 'assessments': ['[[[honest], 0.6, 0.9, null]]']}"
      ]
     },
     "metadata": {},
     "execution_count": 7
    }
   ],
   "metadata": {}
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "source": [
    "g.\\\n",
    "    V()\\\n",
    "    .limit(10)\\\n",
    "    .valueMap()\\\n",
    "    .toList()"
   ],
   "outputs": [
    {
     "output_type": "execute_result",
     "data": {
      "text/plain": [
       "[{'id': [959233366],\n",
       "  'created_at': ['07/21/2021, 10:27:17'],\n",
       "  'text': ['@BDliveSA I stand with honesty and I always will promote honesty. @Ethans_Rolands You are indeed a honest person. H… https://t.co/4M6vRcsQRC'],\n",
       "  'source': ['<a href=\"http://twitter.com/download/android\" rel=\"nofollow\">Twitter for Android</a>'],\n",
       "  'polarity': ['0.6'],\n",
       "  'subjectivity': ['0.9'],\n",
       "  'assessments': ['[[[honest], 0.6, 0.9, null]]']},\n",
       " {'id': [1505115756],\n",
       "  'created_at': ['07/21/2021, 10:28:12'],\n",
       "  'text': ['RT @Allowancefi: 🚀Huge Airdrop to promote Allowance🎉\\n\\n💰10,000,000 Allowance for 50 lucky participants. \\n💰10,000 Allowance for first 10,000…'],\n",
       "  'source': ['<a href=\"http://twitter.com/download/android\" rel=\"nofollow\">Twitter for Android</a>'],\n",
       "  'polarity': ['0.29166666666666663'],\n",
       "  'subjectivity': ['0.5833333333333334'],\n",
       "  'assessments': ['[[[lucky], 0.3333333333333333, 0.8333333333333334, null], [[first], 0.25, 0.3333333333333333, null]]']},\n",
       " {'id': [369509540],\n",
       "  'created_at': ['07/21/2021, 10:33:27'],\n",
       "  'text': ['RT @airdropinspect: New airdrop: Project Larix (LARIX)\\nReward: 30 LARIX\\nRate:⭐️⭐️⭐️⭐️\\nDistribution: Before 5th September 2021\\n\\nBot Airdrop…'],\n",
       "  'source': ['<a href=\"http://twitter.com/download/android\" rel=\"nofollow\">Twitter for Android</a>'],\n",
       "  'polarity': ['0.13636363636363635'],\n",
       "  'subjectivity': ['0.45454545454545453'],\n",
       "  'assessments': ['[[[new], 0.13636363636363635, 0.45454545454545453, null]]']},\n",
       " {'id': [454046330],\n",
       "  'created_at': ['07/21/2021, 10:33:36'],\n",
       "  'text': [\"@Reuters For all those who are new to this working from home Bitcoin trading options \\n\\nHere's a little tip:\\n\\nGet a… https://t.co/AKkzd2wVD5\"],\n",
       "  'source': ['<a href=\"http://twitter.com/download/android\" rel=\"nofollow\">Twitter for Android</a>'],\n",
       "  'polarity': ['-0.025568181818181823'],\n",
       "  'subjectivity': ['0.4772727272727273'],\n",
       "  'assessments': ['[[[new], 0.13636363636363635, 0.45454545454545453, null], [[little], -0.1875, 0.5, null]]']},\n",
       " {'id': [1270789480],\n",
       "  'created_at': ['07/21/2021, 10:34:58'],\n",
       "  'text': ['RT @robxrp1: Narrative shift? The bottom is in? Thanks @LouietheHound for the article.'],\n",
       "  'source': ['<a href=\"http://twitter.com/download/iphone\" rel=\"nofollow\">Twitter for iPhone</a>'],\n",
       "  'polarity': ['0.2'],\n",
       "  'subjectivity': ['0.2'],\n",
       "  'assessments': ['[[[thanks], 0.2, 0.2, null]]']},\n",
       " {'id': [1639126960],\n",
       "  'created_at': ['07/21/2021, 10:35:34'],\n",
       "  'text': ['RT @mungustein: @bradchoosefi @APompliano 100% correct. I agree with with Pomp too.  Bitcoin has its own use case.. to send and receive and…'],\n",
       "  'source': ['<a href=\"http://twitter.com/download/iphone\" rel=\"nofollow\">Twitter for iPhone</a>'],\n",
       "  'polarity': ['0.6'],\n",
       "  'subjectivity': ['1.0'],\n",
       "  'assessments': ['[[[own], 0.6, 1.0, null]]']},\n",
       " {'id': [758250264],\n",
       "  'created_at': ['07/21/2021, 10:41:16'],\n",
       "  'text': ['RT @Allowancefi: 🚀Huge Airdrop to promote Allowance🎉\\n\\n💰10,000,000 Allowance for 50 lucky participants. \\n💰10,000 Allowance for first 10,000…'],\n",
       "  'source': ['<a href=\"http://twitter.com/download/android\" rel=\"nofollow\">Twitter for Android</a>'],\n",
       "  'polarity': ['0.29166666666666663'],\n",
       "  'subjectivity': ['0.5833333333333334'],\n",
       "  'assessments': ['[[[lucky], 0.3333333333333333, 0.8333333333333334, null], [[first], 0.25, 0.3333333333333333, null]]']},\n",
       " {'id': [1508042884],\n",
       "  'created_at': ['07/21/2021, 10:42:31'],\n",
       "  'text': ['RT @CryptoGA_Arena: Will Giveaway Some 💵 Randomly\\n\\nJust Retweet and Comment Why you need Money ❤️\\n\\nTag Some Friends Who Need Financial Supp…'],\n",
       "  'source': ['<a href=\"http://twitter.com/download/android\" rel=\"nofollow\">Twitter for Android</a>'],\n",
       "  'polarity': ['-0.25'],\n",
       "  'subjectivity': ['0.25'],\n",
       "  'assessments': ['[[[randomly], -0.5, 0.5, null], [[financial], 0.0, 0.0, null]]']},\n",
       " {'id': [972247818],\n",
       "  'created_at': ['07/21/2021, 10:48:47'],\n",
       "  'text': ['HOW FUNNY — bitcoin below 29999 is bear 🦍market and bitcoin above  30001 is bull 🐃\\n#Bitcoin #CryptoNews #cryptocrash #cryptotrading'],\n",
       "  'source': ['<a href=\"http://twitter.com/#!/download/ipad\" rel=\"nofollow\">Twitter for iPad</a>'],\n",
       "  'polarity': ['0.125'],\n",
       "  'subjectivity': ['0.55'],\n",
       "  'assessments': ['[[[funny], 0.25, 1.0, null], [[above], 0.0, 0.1, null]]']},\n",
       " {'id': [1506143518],\n",
       "  'created_at': ['07/21/2021, 10:49:40'],\n",
       "  'text': ['RT @CryptoGA_Arena: Will Giveaway Some 💵 Randomly\\n\\nJust Retweet and Comment Why you need Money ❤️\\n\\nTag Some Friends Who Need Financial Supp…'],\n",
       "  'source': ['<a href=\"http://twitter.com/download/android\" rel=\"nofollow\">Twitter for Android</a>'],\n",
       "  'polarity': ['-0.25'],\n",
       "  'subjectivity': ['0.25'],\n",
       "  'assessments': ['[[[randomly], -0.5, 0.5, null], [[financial], 0.0, 0.0, null]]']}]"
      ]
     },
     "metadata": {},
     "execution_count": 8
    }
   ],
   "metadata": {}
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "source": [
    "# Take all messages of twitter, where polarity >= 0.1\n",
    "g.V()\\\n",
    "    .has('polarity', P.gt(0.1))\\\n",
    "    .limit(10)\\\n",
    "    .valueMap()\\\n",
    "    .toList()"
   ],
   "outputs": [
    {
     "output_type": "execute_result",
     "data": {
      "text/plain": [
       "[{'id': [959233366],\n",
       "  'created_at': ['07/21/2021, 10:27:17'],\n",
       "  'text': ['@BDliveSA I stand with honesty and I always will promote honesty. @Ethans_Rolands You are indeed a honest person. H… https://t.co/4M6vRcsQRC'],\n",
       "  'source': ['<a href=\"http://twitter.com/download/android\" rel=\"nofollow\">Twitter for Android</a>'],\n",
       "  'polarity': ['0.6'],\n",
       "  'subjectivity': ['0.9'],\n",
       "  'assessments': ['[[[honest], 0.6, 0.9, null]]']},\n",
       " {'id': [1505115756],\n",
       "  'created_at': ['07/21/2021, 10:28:12'],\n",
       "  'text': ['RT @Allowancefi: 🚀Huge Airdrop to promote Allowance🎉\\n\\n💰10,000,000 Allowance for 50 lucky participants. \\n💰10,000 Allowance for first 10,000…'],\n",
       "  'source': ['<a href=\"http://twitter.com/download/android\" rel=\"nofollow\">Twitter for Android</a>'],\n",
       "  'polarity': ['0.29166666666666663'],\n",
       "  'subjectivity': ['0.5833333333333334'],\n",
       "  'assessments': ['[[[lucky], 0.3333333333333333, 0.8333333333333334, null], [[first], 0.25, 0.3333333333333333, null]]']},\n",
       " {'id': [369509540],\n",
       "  'created_at': ['07/21/2021, 10:33:27'],\n",
       "  'text': ['RT @airdropinspect: New airdrop: Project Larix (LARIX)\\nReward: 30 LARIX\\nRate:⭐️⭐️⭐️⭐️\\nDistribution: Before 5th September 2021\\n\\nBot Airdrop…'],\n",
       "  'source': ['<a href=\"http://twitter.com/download/android\" rel=\"nofollow\">Twitter for Android</a>'],\n",
       "  'polarity': ['0.13636363636363635'],\n",
       "  'subjectivity': ['0.45454545454545453'],\n",
       "  'assessments': ['[[[new], 0.13636363636363635, 0.45454545454545453, null]]']},\n",
       " {'id': [1270789480],\n",
       "  'created_at': ['07/21/2021, 10:34:58'],\n",
       "  'text': ['RT @robxrp1: Narrative shift? The bottom is in? Thanks @LouietheHound for the article.'],\n",
       "  'source': ['<a href=\"http://twitter.com/download/iphone\" rel=\"nofollow\">Twitter for iPhone</a>'],\n",
       "  'polarity': ['0.2'],\n",
       "  'subjectivity': ['0.2'],\n",
       "  'assessments': ['[[[thanks], 0.2, 0.2, null]]']},\n",
       " {'id': [1639126960],\n",
       "  'created_at': ['07/21/2021, 10:35:34'],\n",
       "  'text': ['RT @mungustein: @bradchoosefi @APompliano 100% correct. I agree with with Pomp too.  Bitcoin has its own use case.. to send and receive and…'],\n",
       "  'source': ['<a href=\"http://twitter.com/download/iphone\" rel=\"nofollow\">Twitter for iPhone</a>'],\n",
       "  'polarity': ['0.6'],\n",
       "  'subjectivity': ['1.0'],\n",
       "  'assessments': ['[[[own], 0.6, 1.0, null]]']},\n",
       " {'id': [758250264],\n",
       "  'created_at': ['07/21/2021, 10:41:16'],\n",
       "  'text': ['RT @Allowancefi: 🚀Huge Airdrop to promote Allowance🎉\\n\\n💰10,000,000 Allowance for 50 lucky participants. \\n💰10,000 Allowance for first 10,000…'],\n",
       "  'source': ['<a href=\"http://twitter.com/download/android\" rel=\"nofollow\">Twitter for Android</a>'],\n",
       "  'polarity': ['0.29166666666666663'],\n",
       "  'subjectivity': ['0.5833333333333334'],\n",
       "  'assessments': ['[[[lucky], 0.3333333333333333, 0.8333333333333334, null], [[first], 0.25, 0.3333333333333333, null]]']},\n",
       " {'id': [972247818],\n",
       "  'created_at': ['07/21/2021, 10:48:47'],\n",
       "  'text': ['HOW FUNNY — bitcoin below 29999 is bear 🦍market and bitcoin above  30001 is bull 🐃\\n#Bitcoin #CryptoNews #cryptocrash #cryptotrading'],\n",
       "  'source': ['<a href=\"http://twitter.com/#!/download/ipad\" rel=\"nofollow\">Twitter for iPad</a>'],\n",
       "  'polarity': ['0.125'],\n",
       "  'subjectivity': ['0.55'],\n",
       "  'assessments': ['[[[funny], 0.25, 1.0, null], [[above], 0.0, 0.1, null]]']},\n",
       " {'id': [1076253062],\n",
       "  'created_at': ['07/21/2021, 10:56:07'],\n",
       "  'text': ['RT @airdropinspect: New airdrop: Project Larix (LARIX)\\nReward: 30 LARIX\\nRate:⭐️⭐️⭐️⭐️\\nDistribution: Before 5th September 2021\\n\\nBot Airdrop…'],\n",
       "  'source': ['<a href=\"https://mobile.twitter.com\" rel=\"nofollow\">Twitter Web App</a>'],\n",
       "  'polarity': ['0.13636363636363635'],\n",
       "  'subjectivity': ['0.45454545454545453'],\n",
       "  'assessments': ['[[[new], 0.13636363636363635, 0.45454545454545453, null]]']},\n",
       " {'id': [91836676],\n",
       "  'created_at': ['07/21/2021, 11:01:38'],\n",
       "  'text': ['Great, I Will support this project\\n@WarjantoUtomo @Yayang_Aryani @trisaktisaputro \\n#Hswap #DeFi #HECO #Airdrop… https://t.co/F66QGMfSoL'],\n",
       "  'source': ['<a href=\"https://mobile.twitter.com\" rel=\"nofollow\">Twitter Web App</a>'],\n",
       "  'polarity': ['0.8'],\n",
       "  'subjectivity': ['0.75'],\n",
       "  'assessments': ['[[[great], 0.8, 0.75, null]]']},\n",
       " {'id': [465772286],\n",
       "  'created_at': ['07/21/2021, 11:02:15'],\n",
       "  'text': ['RT @BTC_Archive: Pure Digital, a new #Bitcoin exchange, is launching in London - with the support of 6 banks, including Bank of NY Mellon a…'],\n",
       "  'source': ['<a href=\"https://mobile.twitter.com\" rel=\"nofollow\">Twitter Web App</a>'],\n",
       "  'polarity': ['0.11688311688311688'],\n",
       "  'subjectivity': ['0.3181818181818182'],\n",
       "  'assessments': ['[[[pure], 0.21428571428571427, 0.5, null], [[digital], 0.0, 0.0, null], [[new], 0.13636363636363635, 0.45454545454545453, null]]']}]"
      ]
     },
     "metadata": {},
     "execution_count": 9
    }
   ],
   "metadata": {}
  },
  {
   "cell_type": "code",
   "execution_count": 15,
   "source": [
    "from datetime import datetime, timedelta\n",
    "start_time = datetime.now() - timedelta(days=3)\n",
    "g.V()\\\n",
    "    .has('created_at',\n",
    "         P.gt(start_time.strftime(\"%m/%d/%Y, %H:%M:%S\")))\\\n",
    "    .count()\\\n",
    "    .toList()"
   ],
   "outputs": [
    {
     "output_type": "execute_result",
     "data": {
      "text/plain": [
       "[698]"
      ]
     },
     "metadata": {},
     "execution_count": 15
    }
   ],
   "metadata": {}
  },
  {
   "cell_type": "code",
   "execution_count": 16,
   "source": [
    "# Print id all twiter messages for the last 3 days\n",
    "g.V()\\\n",
    "    .has('created_at',\n",
    "         P.gt(start_time.strftime(\"%m/%d/%Y, %H:%M:%S\")))\\\n",
    "    .limit(10)\\\n",
    "    .toList()"
   ],
   "outputs": [
    {
     "output_type": "execute_result",
     "data": {
      "text/plain": [
       "[v[40964120],\n",
       " v[40968216],\n",
       " v[450752552],\n",
       " v[491524136],\n",
       " v[491528232],\n",
       " v[491532328],\n",
       " v[492187688],\n",
       " v[492191784],\n",
       " v[492404776],\n",
       " v[492408872]]"
      ]
     },
     "metadata": {},
     "execution_count": 16
    }
   ],
   "metadata": {}
  },
  {
   "cell_type": "code",
   "execution_count": 17,
   "source": [
    "# print value by id of twitter message\n",
    "g.V(40964120).valueMap().next()"
   ],
   "outputs": [
    {
     "output_type": "execute_result",
     "data": {
      "text/plain": [
       "{'id': [1543898872],\n",
       " 'created_at': ['07/22/2021, 19:09:38'],\n",
       " 'text': ['RT @airdropinspect: New airdrop: Gamestarter (USDT)\\nTotal Reward: 2000 USDT\\nRate: ⭐️⭐️⭐️⭐️⭐️\\nWinners: 300 Random + 50 Top referrers\\nDistrib…'],\n",
       " 'source': ['<a href=\"http://twitter.com/download/android\" rel=\"nofollow\">Twitter for Android</a>'],\n",
       " 'polarity': ['0.03409090909090909'],\n",
       " 'subjectivity': ['0.5511363636363636'],\n",
       " 'assessments': ['[[[new], 0.13636363636363635, 0.45454545454545453, null], [[total], 0.0, 0.75, null], [[random], -0.5, 0.5, null], [[top], 0.5, 0.5, null]]']}"
      ]
     },
     "metadata": {},
     "execution_count": 17
    }
   ],
   "metadata": {}
  },
  {
   "cell_type": "code",
   "execution_count": 18,
   "source": [
    "# print values for 10 messages for the last 3 days\n",
    "g.V()\\\n",
    "    .has('created_at',\n",
    "         P.gt(start_time.strftime(\"%m/%d/%Y, %H:%M:%S\")))\\\n",
    "    .limit(10)\\\n",
    "    .valueMap()\\\n",
    "    .toList()"
   ],
   "outputs": [
    {
     "output_type": "execute_result",
     "data": {
      "text/plain": [
       "[{'id': [1543898872],\n",
       "  'created_at': ['07/22/2021, 19:09:38'],\n",
       "  'text': ['RT @airdropinspect: New airdrop: Gamestarter (USDT)\\nTotal Reward: 2000 USDT\\nRate: ⭐️⭐️⭐️⭐️⭐️\\nWinners: 300 Random + 50 Top referrers\\nDistrib…'],\n",
       "  'source': ['<a href=\"http://twitter.com/download/android\" rel=\"nofollow\">Twitter for Android</a>'],\n",
       "  'polarity': ['0.03409090909090909'],\n",
       "  'subjectivity': ['0.5511363636363636'],\n",
       "  'assessments': ['[[[new], 0.13636363636363635, 0.45454545454545453, null], [[total], 0.0, 0.75, null], [[random], -0.5, 0.5, null], [[top], 0.5, 0.5, null]]']},\n",
       " {'id': [2143817412],\n",
       "  'created_at': ['07/22/2021, 19:10:38'],\n",
       "  'text': ['Wow, this analyst had predicted that bitcoin cost dropped from $64K to $33K on the 13th of April 2021 and it materi… https://t.co/KyyOF3F3Uu'],\n",
       "  'source': ['<a href=\"https://mobile.twitter.com\" rel=\"nofollow\">Twitter Web App</a>'],\n",
       "  'polarity': ['0.05'],\n",
       "  'subjectivity': ['0.5'],\n",
       "  'assessments': ['[[[wow], 0.1, 1.0, null], [[13th], 0.0, 0.0, null]]']},\n",
       " {'id': [625242956],\n",
       "  'created_at': ['07/22/2021, 19:15:15'],\n",
       "  'text': ['RT @airdropinspect: New airdrop: Riper DeFi (BUSD)\\nTotal Reward: 1500 BUSD\\nRate: ⭐️⭐️⭐️⭐️\\nWinners: 500 Random + Top 50\\nDistribution: within…'],\n",
       "  'source': ['<a href=\"http://twitter.com/download/android\" rel=\"nofollow\">Twitter for Android</a>'],\n",
       "  'polarity': ['0.03409090909090909'],\n",
       "  'subjectivity': ['0.5511363636363636'],\n",
       "  'assessments': ['[[[new], 0.13636363636363635, 0.45454545454545453, null], [[total], 0.0, 0.75, null], [[random], -0.5, 0.5, null], [[top], 0.5, 0.5, null]]']},\n",
       " {'id': [282304434],\n",
       "  'created_at': ['07/23/2021, 10:23:47'],\n",
       "  'text': ['RT @scuderiavedang: Check out my latest #NFT, The Future War https://t.co/FZ3Pw2nw93 via @opensea \\n#nftart #nftcollector #NFTforGood #NFTdr…'],\n",
       "  'source': ['<a href=\"https://mobile.twitter.com\" rel=\"nofollow\">Twitter Web App</a>'],\n",
       "  'polarity': ['0.25'],\n",
       "  'subjectivity': ['0.5125'],\n",
       "  'assessments': ['[[[latest], 0.5, 0.9, null], [[future], 0.0, 0.125, null]]']},\n",
       " {'id': [380525944],\n",
       "  'created_at': ['07/23/2021, 10:23:57'],\n",
       "  'text': [\"RT @BenCaselin: Suddenly decided to pick up this old passion. If @woonomic's charts, @100trillionUSD's models, and @michael_saylor's speech…\"],\n",
       "  'source': ['<a href=\"http://twitter.com/download/android\" rel=\"nofollow\">Twitter for Android</a>'],\n",
       "  'polarity': ['0.05'],\n",
       "  'subjectivity': ['0.35'],\n",
       "  'assessments': ['[[[suddenly], 0.0, 0.5, null], [[old], 0.1, 0.2, null]]']},\n",
       " {'id': [1060761074],\n",
       "  'created_at': ['07/23/2021, 10:25:05'],\n",
       "  'text': ['RT @Cointelegraph: The move follows a report that a large number of JPMorgan clients see cryptocurrencies, including Bitcoin, as an asset c…'],\n",
       "  'source': ['<a href=\"http://twitter.com/download/android\" rel=\"nofollow\">Twitter for Android</a>'],\n",
       "  'polarity': ['0.21428571428571427'],\n",
       "  'subjectivity': ['0.42857142857142855'],\n",
       "  'assessments': ['[[[large], 0.21428571428571427, 0.42857142857142855, null]]']},\n",
       " {'id': [1161094752],\n",
       "  'created_at': ['07/23/2021, 10:39:34'],\n",
       "  'text': ['RT @airdropinspect: New airdrop: Riper DeFi (BUSD)\\nTotal Reward: 1500 BUSD\\nRate: ⭐️⭐️⭐️⭐️\\nWinners: 500 Random + Top 50\\nDistribution: within…'],\n",
       "  'source': ['<a href=\"https://mobile.twitter.com\" rel=\"nofollow\">Twitter Web App</a>'],\n",
       "  'polarity': ['0.03409090909090909'],\n",
       "  'subjectivity': ['0.5511363636363636'],\n",
       "  'assessments': ['[[[new], 0.13636363636363635, 0.45454545454545453, null], [[total], 0.0, 0.75, null], [[random], -0.5, 0.5, null], [[top], 0.5, 0.5, null]]']},\n",
       " {'id': [2051765052],\n",
       "  'created_at': ['07/23/2021, 10:41:03'],\n",
       "  'text': ['RT @penguinpromotes: 🔥$MIL community! Listing on Coinmarketcap today✔️ Auctioning the world’s first Bitcoin rifle with a surprise celebrity…'],\n",
       "  'source': ['<a href=\"http://twitter.com/download/android\" rel=\"nofollow\">Twitter for Android</a>'],\n",
       "  'polarity': ['0.25'],\n",
       "  'subjectivity': ['0.3333333333333333'],\n",
       "  'assessments': ['[[[first], 0.25, 0.3333333333333333, null]]']},\n",
       " {'id': [698722696],\n",
       "  'created_at': ['07/23/2021, 10:45:57'],\n",
       "  'text': [\"RT @JasonADeane: Very much looking forward to speaking (in person no less!) at this event in London's Canary Wharf next Weds, discussing #b…\"],\n",
       "  'source': ['<a href=\"http://twitter.com/download/iphone\" rel=\"nofollow\">Twitter for iPhone</a>'],\n",
       "  'polarity': ['0.12138888888888888'],\n",
       "  'subjectivity': ['0.10888888888888888'],\n",
       "  'assessments': ['[[[very, much], 0.26, 0.26, null], [[no, less, !], 0.10416666666666666, 0.06666666666666667, null], [[next], 0.0, 0.0, null]]']},\n",
       " {'id': [1180589556],\n",
       "  'created_at': ['07/23/2021, 10:46:45'],\n",
       "  'text': ['RT @AirdropDet: 🔍 New #Airdrop: OUD Token\\n\\n💲 Reward: Up to 83 OUD [~$5] +17 OUD [~$1] per referral\\n\\n🔴 Start the airdrop bot: https://t.co/k…'],\n",
       "  'source': ['<a href=\"http://twitter.com/download/android\" rel=\"nofollow\">Twitter for Android</a>'],\n",
       "  'polarity': ['0.13636363636363635'],\n",
       "  'subjectivity': ['0.45454545454545453'],\n",
       "  'assessments': ['[[[new], 0.13636363636363635, 0.45454545454545453, null]]']}]"
      ]
     },
     "metadata": {},
     "execution_count": 18
    }
   ],
   "metadata": {}
  },
  {
   "cell_type": "code",
   "execution_count": 25,
   "source": [
    "# print text \n",
    "g.V()\\\n",
    "    .has('created_at',\n",
    "         P.gt(start_time.strftime(\"%m/%d/%Y, %H:%M:%S\")))\\\n",
    "    .limit(10)\\\n",
    "    .values('text')\\\n",
    "    .toList()"
   ],
   "outputs": [
    {
     "output_type": "execute_result",
     "data": {
      "text/plain": [
       "['RT @airdropinspect: New airdrop: Gamestarter (USDT)\\nTotal Reward: 2000 USDT\\nRate: ⭐️⭐️⭐️⭐️⭐️\\nWinners: 300 Random + 50 Top referrers\\nDistrib…',\n",
       " 'Wow, this analyst had predicted that bitcoin cost dropped from $64K to $33K on the 13th of April 2021 and it materi… https://t.co/KyyOF3F3Uu',\n",
       " 'RT @airdropinspect: New airdrop: Riper DeFi (BUSD)\\nTotal Reward: 1500 BUSD\\nRate: ⭐️⭐️⭐️⭐️\\nWinners: 500 Random + Top 50\\nDistribution: within…',\n",
       " 'RT @airdropinspect: New airdrop: Riper DeFi (BUSD)\\nTotal Reward: 1500 BUSD\\nRate: ⭐️⭐️⭐️⭐️\\nWinners: 500 Random + Top 50\\nDistribution: within…',\n",
       " 'RT @scuderiavedang: Check out my latest #NFT, The Future War https://t.co/FZ3Pw2nw93 via @opensea \\n#nftart #nftcollector #NFTforGood #NFTdr…',\n",
       " \"RT @BenCaselin: Suddenly decided to pick up this old passion. If @woonomic's charts, @100trillionUSD's models, and @michael_saylor's speech…\",\n",
       " 'RT @Cointelegraph: The move follows a report that a large number of JPMorgan clients see cryptocurrencies, including Bitcoin, as an asset c…',\n",
       " 'RT @penguinpromotes: 🔥$MIL community! Listing on Coinmarketcap today✔️ Auctioning the world’s first Bitcoin rifle with a surprise celebrity…',\n",
       " \"RT @JasonADeane: Very much looking forward to speaking (in person no less!) at this event in London's Canary Wharf next Weds, discussing #b…\",\n",
       " 'RT @AirdropDet: 🔍 New #Airdrop: OUD Token\\n\\n💲 Reward: Up to 83 OUD [~$5] +17 OUD [~$1] per referral\\n\\n🔴 Start the airdrop bot: https://t.co/k…']"
      ]
     },
     "metadata": {},
     "execution_count": 25
    }
   ],
   "metadata": {}
  },
  {
   "cell_type": "code",
   "execution_count": 26,
   "source": [
    "data = g.V().limit(50).valueMap().toList()"
   ],
   "outputs": [],
   "metadata": {}
  },
  {
   "cell_type": "code",
   "execution_count": 27,
   "source": [
    "# Data Injering\n",
    "print(len(data))"
   ],
   "outputs": [
    {
     "output_type": "stream",
     "name": "stdout",
     "text": [
      "50\n"
     ]
    }
   ],
   "metadata": {}
  },
  {
   "cell_type": "code",
   "execution_count": 28,
   "source": [
    "print(type(data))"
   ],
   "outputs": [
    {
     "output_type": "stream",
     "name": "stdout",
     "text": [
      "<class 'list'>\n"
     ]
    }
   ],
   "metadata": {}
  },
  {
   "cell_type": "code",
   "execution_count": 29,
   "source": [
    "# print the first element\n",
    "data[0]"
   ],
   "outputs": [
    {
     "output_type": "execute_result",
     "data": {
      "text/plain": [
       "{'id': [959233366],\n",
       " 'created_at': ['07/21/2021, 10:27:17'],\n",
       " 'text': ['@BDliveSA I stand with honesty and I always will promote honesty. @Ethans_Rolands You are indeed a honest person. H… https://t.co/4M6vRcsQRC'],\n",
       " 'source': ['<a href=\"http://twitter.com/download/android\" rel=\"nofollow\">Twitter for Android</a>'],\n",
       " 'polarity': ['0.6'],\n",
       " 'subjectivity': ['0.9'],\n",
       " 'assessments': ['[[[honest], 0.6, 0.9, null]]']}"
      ]
     },
     "metadata": {},
     "execution_count": 29
    }
   ],
   "metadata": {}
  },
  {
   "cell_type": "code",
   "execution_count": 30,
   "source": [
    "data[0].keys()"
   ],
   "outputs": [
    {
     "output_type": "execute_result",
     "data": {
      "text/plain": [
       "dict_keys(['id', 'created_at', 'text', 'source', 'polarity', 'subjectivity', 'assessments'])"
      ]
     },
     "metadata": {},
     "execution_count": 30
    }
   ],
   "metadata": {}
  },
  {
   "cell_type": "code",
   "execution_count": 75,
   "source": [
    "# create simple method with Python typing\n",
    "from typing import List\n",
    "def print_polarity(data: List, value: float, value_subj: float) -> List:\n",
    "    messages = list()\n",
    "    for i in range(len(data)):\n",
    "        polarity = data[i].get('polarity')\n",
    "        subjectivity = data[i].get('subjectivity')\n",
    "\n",
    "        # 1 rules \n",
    "        if float(polarity[0]) >= value:\n",
    "            # 2 rules\n",
    "            if float(subjectivity[0]) >= value_subj:\n",
    "                messages.append(data[i].get('text'))\n",
    "    return messages\n",
    "\n",
    "\n",
    "print_polarity(data=data, value=0.8, value_subj=0.5)\n"
   ],
   "outputs": [
    {
     "output_type": "execute_result",
     "data": {
      "text/plain": [
       "[['Great, I Will support this project\\n@WarjantoUtomo @Yayang_Aryani @trisaktisaputro \\n#Hswap #DeFi #HECO #Airdrop… https://t.co/F66QGMfSoL'],\n",
       " ['Great project \\n@khewinbya \\n@YudMlo \\n@Yop09505545 \\n\\n#cryptocurrency #Crypto #Bitcoin\\xa0 #Ethereum #ETH #Airdrop… https://t.co/MU6lion40N'],\n",
       " ['@Abhi08320020 \\n@abd1798681011 \\n@Sahil79792293 Hey, get 15000000 TOKAU tokens and spread great technology. It’s free… https://t.co/fEQbOiS7M2']]"
      ]
     },
     "metadata": {},
     "execution_count": 75
    }
   ],
   "metadata": {}
  },
  {
   "cell_type": "code",
   "execution_count": 67,
   "source": [
    "# Comprehension in Python\n",
    "'''\n",
    "https://realpython.com/list-comprehension-python/\n",
    "'''\n",
    "[i.get('text') for i in data if float(i.get('polarity')[0]) >= 0.8]"
   ],
   "outputs": [
    {
     "output_type": "execute_result",
     "data": {
      "text/plain": [
       "[['Great, I Will support this project\\n@WarjantoUtomo @Yayang_Aryani @trisaktisaputro \\n#Hswap #DeFi #HECO #Airdrop… https://t.co/F66QGMfSoL'],\n",
       " ['Great project \\n@khewinbya \\n@YudMlo \\n@Yop09505545 \\n\\n#cryptocurrency #Crypto #Bitcoin\\xa0 #Ethereum #ETH #Airdrop… https://t.co/MU6lion40N'],\n",
       " ['@Abhi08320020 \\n@abd1798681011 \\n@Sahil79792293 Hey, get 15000000 TOKAU tokens and spread great technology. It’s free… https://t.co/fEQbOiS7M2']]"
      ]
     },
     "metadata": {},
     "execution_count": 67
    }
   ],
   "metadata": {}
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "source": [
    "# Home work\n",
    "'''\n",
    "1. Create method to filter subjectivity\n",
    "'''"
   ],
   "outputs": [],
   "metadata": {}
  }
 ],
 "metadata": {
  "orig_nbformat": 4,
  "language_info": {
   "name": "python",
   "version": "3.8.10",
   "mimetype": "text/x-python",
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "pygments_lexer": "ipython3",
   "nbconvert_exporter": "python",
   "file_extension": ".py"
  },
  "kernelspec": {
   "name": "python3",
   "display_name": "Python 3.8.10 64-bit ('CRYPTO': venv)"
  },
  "interpreter": {
   "hash": "9cc25d8b1d11776c96fe0458b9ef13517b4b754468bc6724a8c0efa74a493cd7"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}