{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 1,
   "source": [
    "import os\n",
    "import sys\n",
    "import inspect\n",
    "currentdir = os.path.dirname(os.path.abspath(\n",
    "    inspect.getfile(inspect.currentframe())))\n",
    "parentdir = os.path.dirname(currentdir)\n",
    "sys.path.insert(0, parentdir)\n",
    "\n",
    "from send_data import send_data_to_gremlin, g\n",
    "from parsewebcites.parsers_grey_scale import pase_grey_scale\n",
    "from gremlin_python.process.traversal import T"
   ],
   "outputs": [],
   "metadata": {}
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "source": [
    "df = pase_grey_scale()\n",
    "for i in df:\n",
    "    i['name'] = f\"gs_{i.get('Symbol')}\"\n",
    "print(df)"
   ],
   "outputs": [
    {
     "output_type": "stream",
     "name": "stdout",
     "text": [
      "[{'Symbol': 'BTC', 'Total Holdings': '649.28K BTC', 'Total Holdings($)': '$31.74B', 'Holdings(Per Share)': '$44.52', 'Marker Price(Per Share)': '$39.12', 'Premium': '-12.13%', 'Close Time': '2021-08-28', '24H Change': '+0', '7D Change': '-285', '30D Change': '-1032', 'Update Time': '2021-08-29-07:50', 'name': 'gs_BTC'}, {'Symbol': 'ETH', 'Total Holdings': '3.14M ETH', 'Total Holdings($)': '$10.19B', 'Holdings(Per Share)': '$32.13', 'Marker Price(Per Share)': '$31.02', 'Premium': '-3.45%', 'Close Time': '2021-08-28', '24H Change': '+0', '7D Change': '-1722', '30D Change': '-6247', 'Update Time': '2021-08-29-07:50', 'name': 'gs_ETH'}, {'Symbol': 'ETC', 'Total Holdings': '12.28M ETC', 'Total Holdings($)': '$787.7M', 'Holdings(Per Share)': '$53.4', 'Marker Price(Per Share)': '$38.05', 'Premium': '-28.75%', 'Close Time': '2021-08-28', '24H Change': '+0', '7D Change': '-8079', '30D Change': '-29312', 'Update Time': '2021-08-29-07:50', 'name': 'gs_ETC'}, {'Symbol': 'LTC', 'Total Holdings': '1.58M LTC', 'Total Holdings($)': '$276.57M', 'Holdings(Per Share)': '$15.6', 'Marker Price(Per Share)': '$15.62', 'Premium': '0.13%', 'Close Time': '2021-08-28', '24H Change': '+0', '7D Change': '-864', '30D Change': '-3135', 'Update Time': '2021-08-29-07:50', 'name': 'gs_LTC'}, {'Symbol': 'BCH', 'Total Holdings': '318.86K BCH', 'Total Holdings($)': '$205.94M', 'Holdings(Per Share)': '$5.61', 'Marker Price(Per Share)': '$5.26', 'Premium': '-6.24%', 'Close Time': '2021-08-28', '24H Change': '+0', '7D Change': '-175', '30D Change': '-560', 'Update Time': '2021-08-29-07:50', 'name': 'gs_BCH'}, {'Symbol': 'ZEN', 'Total Holdings': '617.04K ZEN', 'Total Holdings($)': '$51.32M', 'Holdings(Per Share)': '$75.96', 'Marker Price(Per Share)': '-', 'Premium': '-', 'Close Time': '2021-08-28', '24H Change': '+0', '7D Change': '-338', '30D Change': '+11025', 'Update Time': '2021-08-29-07:50', 'name': 'gs_ZEN'}, {'Symbol': 'ZEC', 'Total Holdings': '333.4K ZEC', 'Total Holdings($)': '$50.19M', 'Holdings(Per Share)': '$13.25', 'Marker Price(Per Share)': '-', 'Premium': '-', 'Close Time': '2021-08-28', '24H Change': '+0', '7D Change': '-10', '30D Change': '+2987', 'Update Time': '2021-08-29-07:50', 'name': 'gs_ZEC'}, {'Symbol': 'XLM', 'Total Holdings': '73.36M XLM', 'Total Holdings($)': '$25.51M', 'Holdings(Per Share)': '$31.74', 'Marker Price(Per Share)': '-', 'Premium': '-', 'Close Time': '2021-08-28', '24H Change': '+0', '7D Change': '-40208', '30D Change': '+1117709', 'Update Time': '2021-08-29-07:50', 'name': 'gs_XLM'}, {'Symbol': 'MANA', 'Total Holdings': '18.34M MANA', 'Total Holdings($)': '$16.89M', 'Holdings(Per Share)': '$8.83', 'Marker Price(Per Share)': '-', 'Premium': '-', 'Close Time': '2021-08-28', '24H Change': '+0', '7D Change': '+30463', '30D Change': '+495931', 'Update Time': '2021-08-29-07:50', 'name': 'gs_MANA'}, {'Symbol': 'LPT', 'Total Holdings': '460.8K LPT', 'Total Holdings($)': '$9.06M', 'Holdings(Per Share)': '$18.68', 'Marker Price(Per Share)': '-', 'Premium': '-', 'Close Time': '2021-08-28', '24H Change': '+0', '7D Change': '+934', '30D Change': '+14435', 'Update Time': '2021-08-29-07:50', 'name': 'gs_LPT'}, {'Symbol': 'LINK', 'Total Holdings': '291.46K LINK', 'Total Holdings($)': '$7.49M', 'Holdings(Per Share)': '$2.46', 'Marker Price(Per Share)': '-', 'Premium': '-', 'Close Time': '2021-08-28', '24H Change': '+0', '7D Change': '+838', '30D Change': '+10276', 'Update Time': '2021-08-29-07:50', 'name': 'gs_LINK'}, {'Symbol': 'FIL', 'Total Holdings': '69.11K FIL', 'Total Holdings($)': '$5.11M', 'Holdings(Per Share)': '$71.9', 'Marker Price(Per Share)': '-', 'Premium': '-', 'Close Time': '2021-08-28', '24H Change': '+0', '7D Change': '-38', '30D Change': '+3925', 'Update Time': '2021-08-29-07:50', 'name': 'gs_FIL'}, {'Symbol': 'BAT', 'Total Holdings': '5.69M BAT', 'Total Holdings($)': '$4.66M', 'Holdings(Per Share)': '$7.8', 'Marker Price(Per Share)': '-', 'Premium': '-', 'Close Time': '2021-08-28', '24H Change': '+0', '7D Change': '-3117', '30D Change': '+257857', 'Update Time': '2021-08-29-07:50', 'name': 'gs_BAT'}]\n"
     ]
    }
   ],
   "metadata": {}
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "source": [
    "send_data_to_gremlin(df)"
   ],
   "outputs": [
    {
     "output_type": "execute_result",
     "data": {
      "text/plain": [
       "'200'"
      ]
     },
     "metadata": {},
     "execution_count": 3
    }
   ],
   "metadata": {}
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "source": [
    "g.V().groupCount().by(T.label).toList()"
   ],
   "outputs": [
    {
     "output_type": "execute_result",
     "data": {
      "text/plain": [
       "[{'gs_XLM': 5,\n",
       "  'gs_MANA': 5,\n",
       "  'gs_LINK': 5,\n",
       "  'NLP': 1,\n",
       "  'gs_FIL': 5,\n",
       "  'gs_BCH': 5,\n",
       "  'Open Interest': 3,\n",
       "  'Traders': 3,\n",
       "  'gs_BTC': 5,\n",
       "  'Changes': 3,\n",
       "  'gs_ZEC': 5,\n",
       "  'gs_BAT': 5,\n",
       "  'gs_ETC': 5,\n",
       "  'gs_ETH': 5,\n",
       "  'telegram': 1,\n",
       "  'tweet': 86220,\n",
       "  'gs_LTC': 5,\n",
       "  'Asset Manager/': 1,\n",
       "  'gs_ZEN': 5,\n",
       "  'Positions': 3,\n",
       "  'gs_LPT': 5,\n",
       "  'Leveraged': 1,\n",
       "  'cryptos': 10,\n",
       "  'Other': 1,\n",
       "  'Dealer': 1}]"
      ]
     },
     "metadata": {},
     "execution_count": 4
    }
   ],
   "metadata": {}
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "source": [
    "mana = g.V().hasLabel('gs_MANA').valueMap().toList()"
   ],
   "outputs": [],
   "metadata": {}
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "source": [
    "mana[-1]"
   ],
   "outputs": [
    {
     "output_type": "execute_result",
     "data": {
      "text/plain": [
       "{'name': ['gs_MANA'],\n",
       " 'year': [2021],\n",
       " 'month': [8],\n",
       " 'weekday': [3],\n",
       " 'day': [26],\n",
       " 'hour': [21],\n",
       " 'minute': [1],\n",
       " 'second': [52],\n",
       " 'Symbol': ['MANA'],\n",
       " 'Total Holdings': ['18.34M MANA'],\n",
       " 'Total Holdings($)': ['$16.61M'],\n",
       " 'Holdings(Per Share)': ['$8.85'],\n",
       " 'Marker Price(Per Share)': ['-'],\n",
       " 'Premium': ['-'],\n",
       " 'Close Time': ['2021-08-26'],\n",
       " '24H Change': ['-1256'],\n",
       " '7D Change': ['+31722'],\n",
       " '30D Change': ['+494777'],\n",
       " 'Update Time': ['2021-08-26-05:00']}"
      ]
     },
     "metadata": {},
     "execution_count": 6
    }
   ],
   "metadata": {}
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "source": [
    "mana"
   ],
   "outputs": [
    {
     "output_type": "execute_result",
     "data": {
      "text/plain": [
       "[{'year': [2021],\n",
       "  'month': [8],\n",
       "  'weekday': [3],\n",
       "  'day': [26],\n",
       "  'hour': [20],\n",
       "  'minute': [52],\n",
       "  'second': [41],\n",
       "  'Symbol': ['MANA'],\n",
       "  'Total Holdings': ['18.34M MANA'],\n",
       "  'Total Holdings($)': ['$16.61M'],\n",
       "  'Holdings(Per Share)': ['$8.85'],\n",
       "  'Marker Price(Per Share)': ['-'],\n",
       "  'Premium': ['-'],\n",
       "  'Close Time': ['2021-08-26'],\n",
       "  '24H Change': ['-1256'],\n",
       "  '7D Change': ['+31722'],\n",
       "  '30D Change': ['+494777'],\n",
       "  'Update Time': ['2021-08-26-05:00']},\n",
       " {'name': ['gs_MANA'],\n",
       "  'year': [2021],\n",
       "  'month': [8],\n",
       "  'weekday': [6],\n",
       "  'day': [29],\n",
       "  'hour': [14],\n",
       "  'minute': [52],\n",
       "  'second': [22],\n",
       "  'Symbol': ['MANA'],\n",
       "  'Total Holdings': ['18.34M MANA'],\n",
       "  'Total Holdings($)': ['$16.89M'],\n",
       "  'Holdings(Per Share)': ['$8.83'],\n",
       "  'Marker Price(Per Share)': ['-'],\n",
       "  'Premium': ['-'],\n",
       "  'Close Time': ['2021-08-28'],\n",
       "  '24H Change': ['+0'],\n",
       "  '7D Change': ['+30463'],\n",
       "  '30D Change': ['+495931'],\n",
       "  'Update Time': ['2021-08-29-07:50']},\n",
       " {'year': [2021],\n",
       "  'month': [8],\n",
       "  'weekday': [3],\n",
       "  'day': [26],\n",
       "  'hour': [20],\n",
       "  'minute': [23],\n",
       "  'second': [12],\n",
       "  'Symbol': ['MANA'],\n",
       "  'Total Holdings': ['18.34M MANA'],\n",
       "  'Total Holdings($)': ['$16.61M'],\n",
       "  'Holdings(Per Share)': ['$8.85'],\n",
       "  'Marker Price(Per Share)': ['-'],\n",
       "  'Premium': ['-'],\n",
       "  'Close Time': ['2021-08-26'],\n",
       "  '24H Change': ['-1256'],\n",
       "  '7D Change': ['+31722'],\n",
       "  '30D Change': ['+494777'],\n",
       "  'Update Time': ['2021-08-26-05:00']},\n",
       " {'year': [2021],\n",
       "  'month': [8],\n",
       "  'weekday': [3],\n",
       "  'day': [26],\n",
       "  'hour': [20],\n",
       "  'minute': [45],\n",
       "  'second': [12],\n",
       "  'Symbol': ['MANA'],\n",
       "  'Total Holdings': ['18.34M MANA'],\n",
       "  'Total Holdings($)': ['$16.61M'],\n",
       "  'Holdings(Per Share)': ['$8.85'],\n",
       "  'Marker Price(Per Share)': ['-'],\n",
       "  'Premium': ['-'],\n",
       "  'Close Time': ['2021-08-26'],\n",
       "  '24H Change': ['-1256'],\n",
       "  '7D Change': ['+31722'],\n",
       "  '30D Change': ['+494777'],\n",
       "  'Update Time': ['2021-08-26-05:00']},\n",
       " {'name': ['gs_MANA'],\n",
       "  'year': [2021],\n",
       "  'month': [8],\n",
       "  'weekday': [3],\n",
       "  'day': [26],\n",
       "  'hour': [21],\n",
       "  'minute': [1],\n",
       "  'second': [52],\n",
       "  'Symbol': ['MANA'],\n",
       "  'Total Holdings': ['18.34M MANA'],\n",
       "  'Total Holdings($)': ['$16.61M'],\n",
       "  'Holdings(Per Share)': ['$8.85'],\n",
       "  'Marker Price(Per Share)': ['-'],\n",
       "  'Premium': ['-'],\n",
       "  'Close Time': ['2021-08-26'],\n",
       "  '24H Change': ['-1256'],\n",
       "  '7D Change': ['+31722'],\n",
       "  '30D Change': ['+494777'],\n",
       "  'Update Time': ['2021-08-26-05:00']}]"
      ]
     },
     "metadata": {},
     "execution_count": 7
    }
   ],
   "metadata": {}
  },
  {
   "cell_type": "markdown",
   "source": [],
   "metadata": {}
  }
 ],
 "metadata": {
  "orig_nbformat": 4,
  "language_info": {
   "name": "python",
   "version": "3.8.10",
   "mimetype": "text/x-python",
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "pygments_lexer": "ipython3",
   "nbconvert_exporter": "python",
   "file_extension": ".py"
  },
  "kernelspec": {
   "name": "python3",
   "display_name": "Python 3.8.10 64-bit ('CRYPTO': venv)"
  },
  "interpreter": {
   "hash": "9cc25d8b1d11776c96fe0458b9ef13517b4b754468bc6724a8c0efa74a493cd7"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}