{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 1,
   "source": [
    "import os,sys,inspect\n",
    "currentdir = os.path.dirname(os.path.abspath(inspect.getfile(inspect.currentframe())))\n",
    "parentdir = os.path.dirname(currentdir)\n",
    "sys.path.insert(0,parentdir) \n",
    "from send_data import send_data_to_gremlin, g\n",
    "from parsewebcites.parsers_cot import get_cot_data\n",
    "from gremlin_python.process.traversal import T\n"
   ],
   "outputs": [],
   "metadata": {}
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "source": [
    "df = get_cot_data()\n",
    "print(df)"
   ],
   "outputs": [
    {
     "output_type": "stream",
     "name": "stdout",
     "text": [
      "[{'name': 'Positions', 'open interest': '7,515', 'Dealer long': '252', 'Dealer short': '110', 'Dealer spreading': '32', 'Institutional long': '695', 'Institutional short': '311', 'Institutional spreading': '9', 'Leveraged long': '2,016', 'Leveraged short': '5,302', 'Leveraged spreading': '591', 'Other long': '1,864', 'Other short': '247', 'Other spreading': '133'}, {'name': 'Changes', 'open interest': '152', 'Dealer long': '-36', 'Dealer short': '58', 'Dealer spreading': '-60', 'Institutional long': '23', 'Institutional short': '0', 'Institutional spreading': '0', 'Leveraged long': '-276', 'Leveraged short': '-240', 'Leveraged spreading': '392', 'Other long': '19', 'Other short': '8', 'Other spreading': '30', 'Nonreportable long': '60', 'Nonreportable short': '-36'}, {'name': 'Open Interest', 'open interest': 'Trader', 'Dealer long': '3.4', 'Dealer short': '1.5', 'Dealer spreading': '0.4', 'Institutional long': '9.2', 'Institutional short': '4.1', 'Institutional spreading': '0.1', 'Leveraged long': '26.8', 'Leveraged short': '70.6', 'Leveraged spreading': '7.9', 'Other long': '24.8', 'Other short': '3.3', 'Other spreading': '1.8', 'Nonreportable long': '25.6', 'Nonreportable short': '10.4'}, {'name': 'Traders', 'open interest': '78', 'Dealer long': '.', 'Dealer short': '.', 'Dealer spreading': '.', 'Institutional long': '8', 'Institutional short': '.', 'Institutional spreading': '.', 'Leveraged long': '27', 'Leveraged short': '23', 'Leveraged spreading': '9', 'Other long': '9', 'Other short': '.', 'Other spreading': '.'}]\n"
     ]
    }
   ],
   "metadata": {}
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "source": [
    "send_data_to_gremlin(df)"
   ],
   "outputs": [
    {
     "output_type": "execute_result",
     "data": {
      "text/plain": [
       "'200'"
      ]
     },
     "metadata": {},
     "execution_count": 3
    }
   ],
   "metadata": {}
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "source": [
    "g.V().groupCount().by(T.label).toList()"
   ],
   "outputs": [
    {
     "output_type": "execute_result",
     "data": {
      "text/plain": [
       "[{'gs_XLM': 4,\n",
       "  'gs_MANA': 4,\n",
       "  'gs_LINK': 4,\n",
       "  'NLP': 1,\n",
       "  'gs_FIL': 4,\n",
       "  'gs_BCH': 4,\n",
       "  'Open Interest': 3,\n",
       "  'Traders': 3,\n",
       "  'gs_BTC': 4,\n",
       "  'Changes': 3,\n",
       "  'gs_ZEC': 4,\n",
       "  'gs_BAT': 4,\n",
       "  'gs_ETC': 4,\n",
       "  'gs_ETH': 4,\n",
       "  'telegram': 1,\n",
       "  'tweet': 86220,\n",
       "  'gs_LTC': 4,\n",
       "  'Asset Manager/': 1,\n",
       "  'gs_ZEN': 4,\n",
       "  'Positions': 3,\n",
       "  'gs_LPT': 4,\n",
       "  'Leveraged': 1,\n",
       "  'cryptos': 10,\n",
       "  'Other': 1,\n",
       "  'Dealer': 1}]"
      ]
     },
     "metadata": {},
     "execution_count": 4
    }
   ],
   "metadata": {}
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "source": [
    "open_interest = g.V().hasLabel('Open Interest').valueMap().toList()"
   ],
   "outputs": [],
   "metadata": {}
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "source": [
    "open_interest[-1]"
   ],
   "outputs": [
    {
     "output_type": "execute_result",
     "data": {
      "text/plain": [
       "{'name': ['Open Interest'],\n",
       " 'year': [2021],\n",
       " 'month': [8],\n",
       " 'weekday': [3],\n",
       " 'day': [26],\n",
       " 'hour': [21],\n",
       " 'minute': [3],\n",
       " 'second': [29],\n",
       " 'open interest': ['Trader'],\n",
       " 'Dealer long': ['3.9'],\n",
       " 'Dealer short': ['0.7'],\n",
       " 'Dealer spreading': ['1.2'],\n",
       " 'Institutional long': ['9.1'],\n",
       " 'Institutional short': ['4.2'],\n",
       " 'Institutional spreading': ['0.1'],\n",
       " 'Leveraged long': ['31.1'],\n",
       " 'Leveraged short': ['75.3'],\n",
       " 'Leveraged spreading': ['2.7'],\n",
       " 'Other long': ['25.1'],\n",
       " 'Other short': ['3.2'],\n",
       " 'Other spreading': ['1.4'],\n",
       " 'Nonreportable long': ['25.3'],\n",
       " 'Nonreportable short': ['11.1']}"
      ]
     },
     "metadata": {},
     "execution_count": 8
    }
   ],
   "metadata": {}
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "source": [],
   "outputs": [],
   "metadata": {}
  }
 ],
 "metadata": {
  "orig_nbformat": 4,
  "language_info": {
   "name": "python",
   "version": "3.8.10",
   "mimetype": "text/x-python",
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "pygments_lexer": "ipython3",
   "nbconvert_exporter": "python",
   "file_extension": ".py"
  },
  "kernelspec": {
   "name": "python3",
   "display_name": "Python 3.8.10 64-bit ('CRYPTO': venv)"
  },
  "interpreter": {
   "hash": "9cc25d8b1d11776c96fe0458b9ef13517b4b754468bc6724a8c0efa74a493cd7"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}