{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 24,
   "source": [
    "from gremlin_python.process.anonymous_traversal import traversal\n",
    "from gremlin_python.driver.driver_remote_connection import\\\n",
    "    DriverRemoteConnection\n",
    "from gremlin_python.process.traversal import T\n",
    "from gremlin_python.process.traversal import P\n",
    "from gremlin_python.process.graph_traversal import __\n",
    "import json\n",
    "import uuid\n",
    "from gremlin_python.process.traversal import Order\n",
    "import nest_asyncio\n",
    "nest_asyncio.apply()\n",
    "from datetime import datetime\n",
    "from gremlin_python.driver.client import Client\n",
    "import logging\n",
    "import time\n",
    "from typing import List\n",
    "from gremlin_python.process.traversal import Column\n",
    "import requests\n",
    "from bs4 import BeautifulSoup"
   ],
   "outputs": [],
   "metadata": {}
  },
  {
   "cell_type": "code",
   "execution_count": 25,
   "source": [
    "\n",
    "URL = 'https://www.cftc.gov/dea/futures/financial_lf.htm'\n",
    "HEADERS = {'accept':\n",
    "           'text/html,application/xhtml+xml,application/xml;q=0.9,image/avif,\\\n",
    "        image/webp,image/apng,*/*;q=0.8,application/signed-exchange;\\\n",
    "        v=b3;q=0.9', 'user-agent':\n",
    "           'Mozilla/5.0 (X11; Linux x86_64) AppleWebKit/537.36 (KHTML, \\\n",
    "        like Gecko) Chrome/86.0.4240.111 Safari/537.36'}\n",
    "\n",
    "\n",
    "def get_html(url, params=None):\n",
    "    return requests.get(url, headers=HEADERS, params=params)\n",
    "\n",
    "\n",
    "def get_data_from_html(URL):\n",
    "    html = get_html(URL)\n",
    "    soup = BeautifulSoup(html.text, 'html.parser')\n",
    "    items = soup.find('pre')\n",
    "    return items.text.split(\n",
    "        \"-----------------------------------------------------------------------------------------------------------------------------------------------------------\"\n",
    "    )\n",
    "\n",
    "\n",
    "def processing_data(data):\n",
    "    bitcoin_data = [i for i in data if i.find('BITCOIN') != -1]\n",
    "    bitcoin_data = bitcoin_data[0].split('\\r')\n",
    "    bitcoin_data = [i.split('\\n') for i in bitcoin_data]\n",
    "    bitcoin_data = [[s for s in i if s not in [\"\", ' ']]\n",
    "                    for i in bitcoin_data]\n",
    "    bitcoin_data = list(filter(None, bitcoin_data))\n",
    "    bitcoin_data = [[\" \".join(s.split()) for s in i]for i in bitcoin_data]\n",
    "    bitcoin_data = [[s.replace('.', '0') for s in i]for i in bitcoin_data]\n",
    "    return bitcoin_data\n",
    "\n",
    "\n",
    "def get_rows(bitcoin_data):\n",
    "    key_word = ['positions', 'changes', 'percent', 'number']\n",
    "    name_rows = []\n",
    "    data_f = []\n",
    "    for k in key_word:\n",
    "        for i in range(len(bitcoin_data)):\n",
    "            if bitcoin_data[i][0].lower().find(k) != -1:\n",
    "                name_rows.append(bitcoin_data[i][0])\n",
    "                data_f.append(bitcoin_data[i+1][0].split())\n",
    "    return name_rows, data_f\n",
    "\n",
    "\n",
    "def get_timestano(name_rows):\n",
    "    timestamp = list(filter(lambda s: s.find(\"from: \") != -1, name_rows))\n",
    "    if timestamp:\n",
    "        index = timestamp[0].split(',')\n",
    "        index = [i.strip() for i in index]\n",
    "        index = [i.split() for i in index]\n",
    "        timestamp = f'{\" \".join(index[0][-2:])} {index[1][0]}'\n",
    "    return timestamp\n",
    "\n",
    "\n",
    "def get_headers(data):\n",
    "    headers = list(filter(None, data[1].split(':')))\n",
    "    headers = [i.strip() for i in headers]\n",
    "    headers = list(filter(None, headers))\n",
    "    return headers\n",
    "\n",
    "\n",
    "def parse_cftc_to_json():\n",
    "\n",
    "    data = get_data_from_html(URL)\n",
    "    bitcoin_data = processing_data(data)\n",
    "    name_rows, data_f = get_rows(bitcoin_data)\n",
    "    timestamp = get_timestano(name_rows)\n",
    "    headers = get_headers(data)\n",
    "\n",
    "    return {headers[i]: {\n",
    "        'timestamp': timestamp,\n",
    "        'values': data_f[i],\n",
    "        'name_rows': name_rows[i],\n",
    "        'name_columns': headers[-12:]\n",
    "    } for i in range(len(headers[:4]))}\n",
    "\n",
    "\n",
    "def create_inject_query(message, node):\n",
    "    return g.inject([message])\\\n",
    "        .unfold().as_('entity')\\\n",
    "        .addV(node).as_('v')\\\n",
    "        .sideEffect(__.select('entity')\n",
    "                    .unfold().as_('kv').select('v')\n",
    "                    .property(__.select('kv')\n",
    "                              .by(Column.keys),\n",
    "                              __.select('kv')\n",
    "                              .by(Column.values))\n",
    "                    )\\\n",
    "        .id()\\\n",
    "        .toList()"
   ],
   "outputs": [],
   "metadata": {}
  },
  {
   "cell_type": "code",
   "execution_count": 26,
   "source": [
    "df = parse_cftc_to_json()"
   ],
   "outputs": [],
   "metadata": {}
  },
  {
   "cell_type": "code",
   "execution_count": 27,
   "source": [
    "df.keys()"
   ],
   "outputs": [
    {
     "output_type": "execute_result",
     "data": {
      "text/plain": [
       "dict_keys(['Dealer', 'Asset Manager/', 'Leveraged', 'Other'])"
      ]
     },
     "metadata": {},
     "execution_count": 27
    }
   ],
   "metadata": {}
  },
  {
   "cell_type": "code",
   "execution_count": 28,
   "source": [
    "server = '135.181.30.253'\n",
    "port = 8182\n",
    "endpoint = 'ws://' + server + ':' + str(port) + '/gremlin'\n",
    "transport_args = {'max_content_length': 200000}\n",
    "\n",
    "connection = DriverRemoteConnection(endpoint, 'g', **transport_args)\n",
    "# Connection 1 to read data\n",
    "g = traversal().withRemote(connection)\n",
    "# Connection 2 to write data\n",
    "client = Client(endpoint, 'g')\n"
   ],
   "outputs": [],
   "metadata": {}
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "source": [
    "# Print 10 messages from server\n",
    "g.V().limit(10).valueMap().toList()"
   ],
   "outputs": [
    {
     "output_type": "execute_result",
     "data": {
      "text/plain": [
       "[{'id': [959233366],\n",
       "  'created_at': ['07/21/2021, 10:27:17'],\n",
       "  'text': ['@BDliveSA I stand with honesty and I always will promote honesty. @Ethans_Rolands You are indeed a honest person. H… https://t.co/4M6vRcsQRC'],\n",
       "  'source': ['<a href=\"http://twitter.com/download/android\" rel=\"nofollow\">Twitter for Android</a>'],\n",
       "  'polarity': ['0.6'],\n",
       "  'subjectivity': ['0.9'],\n",
       "  'assessments': ['[[[honest], 0.6, 0.9, null]]']},\n",
       " {'id': [1505115756],\n",
       "  'created_at': ['07/21/2021, 10:28:12'],\n",
       "  'text': ['RT @Allowancefi: 🚀Huge Airdrop to promote Allowance🎉\\n\\n💰10,000,000 Allowance for 50 lucky participants. \\n💰10,000 Allowance for first 10,000…'],\n",
       "  'source': ['<a href=\"http://twitter.com/download/android\" rel=\"nofollow\">Twitter for Android</a>'],\n",
       "  'polarity': ['0.29166666666666663'],\n",
       "  'subjectivity': ['0.5833333333333334'],\n",
       "  'assessments': ['[[[lucky], 0.3333333333333333, 0.8333333333333334, null], [[first], 0.25, 0.3333333333333333, null]]']},\n",
       " {'id': [369509540],\n",
       "  'created_at': ['07/21/2021, 10:33:27'],\n",
       "  'text': ['RT @airdropinspect: New airdrop: Project Larix (LARIX)\\nReward: 30 LARIX\\nRate:⭐️⭐️⭐️⭐️\\nDistribution: Before 5th September 2021\\n\\nBot Airdrop…'],\n",
       "  'source': ['<a href=\"http://twitter.com/download/android\" rel=\"nofollow\">Twitter for Android</a>'],\n",
       "  'polarity': ['0.13636363636363635'],\n",
       "  'subjectivity': ['0.45454545454545453'],\n",
       "  'assessments': ['[[[new], 0.13636363636363635, 0.45454545454545453, null]]']},\n",
       " {'id': [454046330],\n",
       "  'created_at': ['07/21/2021, 10:33:36'],\n",
       "  'text': [\"@Reuters For all those who are new to this working from home Bitcoin trading options \\n\\nHere's a little tip:\\n\\nGet a… https://t.co/AKkzd2wVD5\"],\n",
       "  'source': ['<a href=\"http://twitter.com/download/android\" rel=\"nofollow\">Twitter for Android</a>'],\n",
       "  'polarity': ['-0.025568181818181823'],\n",
       "  'subjectivity': ['0.4772727272727273'],\n",
       "  'assessments': ['[[[new], 0.13636363636363635, 0.45454545454545453, null], [[little], -0.1875, 0.5, null]]']},\n",
       " {'id': [1270789480],\n",
       "  'created_at': ['07/21/2021, 10:34:58'],\n",
       "  'text': ['RT @robxrp1: Narrative shift? The bottom is in? Thanks @LouietheHound for the article.'],\n",
       "  'source': ['<a href=\"http://twitter.com/download/iphone\" rel=\"nofollow\">Twitter for iPhone</a>'],\n",
       "  'polarity': ['0.2'],\n",
       "  'subjectivity': ['0.2'],\n",
       "  'assessments': ['[[[thanks], 0.2, 0.2, null]]']},\n",
       " {'id': [1639126960],\n",
       "  'created_at': ['07/21/2021, 10:35:34'],\n",
       "  'text': ['RT @mungustein: @bradchoosefi @APompliano 100% correct. I agree with with Pomp too.  Bitcoin has its own use case.. to send and receive and…'],\n",
       "  'source': ['<a href=\"http://twitter.com/download/iphone\" rel=\"nofollow\">Twitter for iPhone</a>'],\n",
       "  'polarity': ['0.6'],\n",
       "  'subjectivity': ['1.0'],\n",
       "  'assessments': ['[[[own], 0.6, 1.0, null]]']},\n",
       " {'id': [758250264],\n",
       "  'created_at': ['07/21/2021, 10:41:16'],\n",
       "  'text': ['RT @Allowancefi: 🚀Huge Airdrop to promote Allowance🎉\\n\\n💰10,000,000 Allowance for 50 lucky participants. \\n💰10,000 Allowance for first 10,000…'],\n",
       "  'source': ['<a href=\"http://twitter.com/download/android\" rel=\"nofollow\">Twitter for Android</a>'],\n",
       "  'polarity': ['0.29166666666666663'],\n",
       "  'subjectivity': ['0.5833333333333334'],\n",
       "  'assessments': ['[[[lucky], 0.3333333333333333, 0.8333333333333334, null], [[first], 0.25, 0.3333333333333333, null]]']},\n",
       " {'id': [1508042884],\n",
       "  'created_at': ['07/21/2021, 10:42:31'],\n",
       "  'text': ['RT @CryptoGA_Arena: Will Giveaway Some 💵 Randomly\\n\\nJust Retweet and Comment Why you need Money ❤️\\n\\nTag Some Friends Who Need Financial Supp…'],\n",
       "  'source': ['<a href=\"http://twitter.com/download/android\" rel=\"nofollow\">Twitter for Android</a>'],\n",
       "  'polarity': ['-0.25'],\n",
       "  'subjectivity': ['0.25'],\n",
       "  'assessments': ['[[[randomly], -0.5, 0.5, null], [[financial], 0.0, 0.0, null]]']},\n",
       " {'id': [972247818],\n",
       "  'created_at': ['07/21/2021, 10:48:47'],\n",
       "  'text': ['HOW FUNNY — bitcoin below 29999 is bear 🦍market and bitcoin above  30001 is bull 🐃\\n#Bitcoin #CryptoNews #cryptocrash #cryptotrading'],\n",
       "  'source': ['<a href=\"http://twitter.com/#!/download/ipad\" rel=\"nofollow\">Twitter for iPad</a>'],\n",
       "  'polarity': ['0.125'],\n",
       "  'subjectivity': ['0.55'],\n",
       "  'assessments': ['[[[funny], 0.25, 1.0, null], [[above], 0.0, 0.1, null]]']},\n",
       " {'id': [1506143518],\n",
       "  'created_at': ['07/21/2021, 10:49:40'],\n",
       "  'text': ['RT @CryptoGA_Arena: Will Giveaway Some 💵 Randomly\\n\\nJust Retweet and Comment Why you need Money ❤️\\n\\nTag Some Friends Who Need Financial Supp…'],\n",
       "  'source': ['<a href=\"http://twitter.com/download/android\" rel=\"nofollow\">Twitter for Android</a>'],\n",
       "  'polarity': ['-0.25'],\n",
       "  'subjectivity': ['0.25'],\n",
       "  'assessments': ['[[[randomly], -0.5, 0.5, null], [[financial], 0.0, 0.0, null]]']}]"
      ]
     },
     "metadata": {},
     "execution_count": 4
    }
   ],
   "metadata": {}
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "source": [
    "# drop all messages from the server\n",
    "# g.V().drop().iterate()\n",
    "# g.V().count().next()"
   ],
   "outputs": [],
   "metadata": {}
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "source": [
    "# Command to check information from the server\n",
    "# docker-compose -f  docker-compose-cql-es.yml logs -f"
   ],
   "outputs": [],
   "metadata": {}
  },
  {
   "cell_type": "markdown",
   "source": [
    "# Parse data to server\n"
   ],
   "metadata": {}
  },
  {
   "cell_type": "code",
   "execution_count": 29,
   "source": [
    "def create_inject_query(message, node):\n",
    "    return g.inject([message])\\\n",
    "        .unfold().as_('entity')\\\n",
    "        .addV(node).as_('v')\\\n",
    "        .sideEffect(__.select('entity')\n",
    "                    .unfold().as_('kv').select('v')\n",
    "                    .property(__.select('kv')\n",
    "                              .by(Column.keys),\n",
    "                              __.select('kv')\n",
    "                              .by(Column.values))\n",
    "                    )\\\n",
    "        .id()\\\n",
    "        .toList()"
   ],
   "outputs": [],
   "metadata": {}
  },
  {
   "cell_type": "markdown",
   "source": [],
   "metadata": {}
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "source": [
    "## create message \n",
    "message = {\n",
    "    'text': 'hello, this is test message',\n",
    "    'polarity': '1.0'\n",
    "}"
   ],
   "outputs": [],
   "metadata": {}
  },
  {
   "cell_type": "code",
   "execution_count": 34,
   "source": [
    "message = df.get('Dealer')\n",
    "message['values'] = str(message['values'])\n",
    "message['name_columns'] = str(message['name_columns'])"
   ],
   "outputs": [],
   "metadata": {}
  },
  {
   "cell_type": "code",
   "execution_count": 35,
   "source": [
    "message"
   ],
   "outputs": [
    {
     "output_type": "execute_result",
     "data": {
      "text/plain": [
       "{'timestamp': 'August 10 2021',\n",
       " 'values': \"['288', '52', '92', '672', '311', '9', '2,292', '5,542', '199', '1,845', '239', '103', '1,863', '816']\",\n",
       " 'name_rows': 'Positions',\n",
       " 'name_columns': \"['Spreading', 'Long', 'Short', 'Spreading', 'Long', 'Short', 'Spreading', 'Long', 'Short', 'Spreading', 'Long', 'Short']\"}"
      ]
     },
     "metadata": {},
     "execution_count": 35
    }
   ],
   "metadata": {}
  },
  {
   "cell_type": "code",
   "execution_count": 36,
   "source": [
    "## send to server message\n",
    "create_inject_query(message=message, node='Dealer')"
   ],
   "outputs": [
    {
     "output_type": "execute_result",
     "data": {
      "text/plain": [
       "[8432]"
      ]
     },
     "metadata": {},
     "execution_count": 36
    }
   ],
   "metadata": {}
  },
  {
   "cell_type": "code",
   "execution_count": 39,
   "source": [
    "g.V(8432).valueMap().next()"
   ],
   "outputs": [
    {
     "output_type": "execute_result",
     "data": {
      "text/plain": [
       "{'timestamp': ['August 10 2021'],\n",
       " 'values': [\"['288', '52', '92', '672', '311', '9', '2,292', '5,542', '199', '1,845', '239', '103', '1,863', '816']\"],\n",
       " 'name_rows': ['Positions'],\n",
       " 'name_columns': [\"['Spreading', 'Long', 'Short', 'Spreading', 'Long', 'Short', 'Spreading', 'Long', 'Short', 'Spreading', 'Long', 'Short']\"]}"
      ]
     },
     "metadata": {},
     "execution_count": 39
    }
   ],
   "metadata": {}
  },
  {
   "cell_type": "code",
   "execution_count": 38,
   "source": [
    "df.get('Dealer')"
   ],
   "outputs": [
    {
     "output_type": "execute_result",
     "data": {
      "text/plain": [
       "{'timestamp': 'August 10 2021',\n",
       " 'values': \"['288', '52', '92', '672', '311', '9', '2,292', '5,542', '199', '1,845', '239', '103', '1,863', '816']\",\n",
       " 'name_rows': 'Positions',\n",
       " 'name_columns': \"['Spreading', 'Long', 'Short', 'Spreading', 'Long', 'Short', 'Spreading', 'Long', 'Short', 'Spreading', 'Long', 'Short']\"}"
      ]
     },
     "metadata": {},
     "execution_count": 38
    }
   ],
   "metadata": {}
  },
  {
   "cell_type": "code",
   "execution_count": 15,
   "source": [
    "# check message on the server\n",
    "g.V('7987440').valueMap().toList()"
   ],
   "outputs": [
    {
     "output_type": "execute_result",
     "data": {
      "text/plain": [
       "[{'text': ['hello, this is test message'], 'polarity': [1.0]}]"
      ]
     },
     "metadata": {},
     "execution_count": 15
    }
   ],
   "metadata": {}
  },
  {
   "cell_type": "markdown",
   "source": [
    "# To send big data messages to server. Aproach 2"
   ],
   "metadata": {}
  },
  {
   "cell_type": "markdown",
   "source": [],
   "metadata": {}
  },
  {
   "cell_type": "code",
   "execution_count": 21,
   "source": [
    "\n",
    "data = '[[\"crypto\": \"BTC\"], [\"crypto\": \"ETH\", \"coef\": 2]]'\n",
    "node = 'market'\n",
    "req = f'g.inject({data}).unfold().as(\"m\").addV(\"{node}\").as(\"v\").select(\"m\").unfold().as(\"kv\").select(\"v\").property(select(\"kv\").by(keys), select(\"kv\").by(values)).id().toList()' \n",
    "client.submit(req).all().result()"
   ],
   "outputs": [
    {
     "output_type": "execute_result",
     "data": {
      "text/plain": [
       "[16425160, 8495312, 8495312]"
      ]
     },
     "metadata": {},
     "execution_count": 21
    }
   ],
   "metadata": {}
  },
  {
   "cell_type": "code",
   "execution_count": 37,
   "source": [
    "g.V(8495312).label().toList()"
   ],
   "outputs": [
    {
     "output_type": "execute_result",
     "data": {
      "text/plain": [
       "['market']"
      ]
     },
     "metadata": {},
     "execution_count": 37
    }
   ],
   "metadata": {}
  },
  {
   "cell_type": "markdown",
   "source": [
    "# Generate data\n"
   ],
   "metadata": {}
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "source": [
    "import numpy as np\n",
    "crypto_tickers = ['BTC', 'ETH', 'LIT', 'SFP', 'TWT', 'DOT']\n",
    "trading_signals = ['buy', 'sel', 'hold']\n",
    "social_activites = ['high', 'slow', 'normal']\n",
    "coefs = np.random.random_integers(low=1, high=100, size=20)\n",
    "messages = list()\n",
    "for i in range(10):\n",
    "    ticker = np.random.choice(crypto_tickers)\n",
    "    signal = np.random.choice(trading_signals)\n",
    "    activities = np.random.choice(social_activites)\n",
    "    coef = np.random.choice(coefs)\n",
    "    # Test for generate data\n",
    "    # combine_data = dict({\n",
    "    #     'ticker': ticker,\n",
    "    #     'signal': signal,\n",
    "    #     'activities': activities,\n",
    "    #     'coef': coef\n",
    "    # })\n",
    "    # messages.append(combine_data)\n",
    "\n",
    "    # Send data to server\n",
    "    data = f'[[\"ticker\": \"{ticker}\", \"signal\": \"{signal}\", \"activities\": \"{activities}\", \"coef\": \"{coef}\"]]'\n",
    "    node = 'cryptos'\n",
    "    req = f'g.inject({data}).unfold().as(\"m\").addV(\"{node}\").as(\"v\").select(\"m\").unfold().as(\"kv\").select(\"v\").property(select(\"kv\").by(keys), select(\"kv\").by(values)).id().toList()'\n",
    "    client.submit(req).all().result()\n"
   ],
   "outputs": [
    {
     "output_type": "stream",
     "name": "stderr",
     "text": [
      "<ipython-input-8-ab0a4563e353>:5: DeprecationWarning: This function is deprecated. Please call randint(1, 100 + 1) instead\n",
      "  coefs = np.random.random_integers(low=1, high=100, size=20)\n"
     ]
    }
   ],
   "metadata": {}
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "source": [
    "g.V().hasLabel(node).count().toList()"
   ],
   "outputs": [
    {
     "output_type": "execute_result",
     "data": {
      "text/plain": [
       "[10]"
      ]
     },
     "metadata": {},
     "execution_count": 9
    }
   ],
   "metadata": {}
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "source": [
    "# Architecture to parse data\n",
    "# Parse data\n",
    "# 1 Twiiter\n",
    "# 2. Telegram \n",
    "# 3. News\n",
    "# 4. Binance api (transaction, volume, count ticks)\n",
    "# datetime.now()"
   ],
   "outputs": [],
   "metadata": {}
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "source": [],
   "outputs": [],
   "metadata": {}
  }
 ],
 "metadata": {
  "orig_nbformat": 4,
  "language_info": {
   "name": "python",
   "version": "3.8.10",
   "mimetype": "text/x-python",
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "pygments_lexer": "ipython3",
   "nbconvert_exporter": "python",
   "file_extension": ".py"
  },
  "kernelspec": {
   "name": "python3",
   "display_name": "Python 3.8.10 64-bit ('CRYPTO': venv)"
  },
  "interpreter": {
   "hash": "9cc25d8b1d11776c96fe0458b9ef13517b4b754468bc6724a8c0efa74a493cd7"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}